# 3.Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов».
# Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

for i in range(1, 101):
    if i == 1:
        print(f' {i} процент')
    elif i == 21:
        print(f' {i} процент')
    elif i == 31:
        print(f' {i} процент')
    elif i == 41:
        print(f' {i} процент')
    elif i == 51:
        print(f' {i} процент')
    elif i == 61:
        print(f' {i} процент')
    elif i == 71:
        print(f' {i} процент')
    elif i == 81:
        print(f' {i} процент')
    elif i == 91:
        print(f' {i} процент')
    elif 2 <= i <= 4:
        print(f' {i} процента')
    elif 22 <= i <= 24:
        print(f' {i} процента')
    elif 32 <= i <= 34:
        print(f' {i} процента')
    elif 42 <= i <= 44:
        print(f' {i} процента')
    elif 52 <= i <= 54:
        print(f' {i} процента')
    elif 62 <= i <= 64:
        print(f' {i} процента')
    elif 72 <= i <= 74:
        print(f' {i} процента')
    elif 82 <= i <= 84:
        print(f' {i} процента')
    elif 92 <= i <= 94:
        print(f' {i} процента')
    else:
        print(f' {i} процентов')